let express = require("express");
let router = express.Router();

const NUMBERS_ARRAY = [
  [
    "ноль",
    "один",
    "два",
    "три",
    "четыре",
    "пять",
    "шесть",
    "семь",
    "восемь",
    "девять",
    "десять",
    "одиннадцать",
    "двенадцать",
    "тринадцать",
    "четырнадцать",
    "пятнадцать",
    "шестнадцать",
    "семнадцать",
    "восемнадцать",
    "девятнадцать"
  ],
  [
    "",
    "",
    "двадцать",
    "тридцать",
    "сорок",
    "пятьдесят",
    "шестьдесят",
    "семьдесят",
    "восемьдесят",
    "девяносто"
  ],
  [
    "",
    "сто",
    "двести",
    "триста",
    "четыреста",
    "пятьсот",
    "шестьсот",
    "семьсот",
    "восемьсот",
    "девятьсот"
  ]
];

const REGIONS = [
  ["22", "Алтайский край"],
  ["28", "Амурская область"],
  ["29", "Архангельская область"],
  ["30", "Астраханская область"],
  ["31", "Белгородская область"],
  ["32", "Брянская область"],
  ["33", "Владимирская область"],
  ["34", "Волгоградская область"],
  ["35", "Вологодская область"],
  ["36", "Воронежская область"],
  ["77", "г. Москва"],
  ["79", "Еврейская автономная область"],
  ["75", "Забайкальский край"],
  ["37", "Ивановская область"],
  ["99", "Иные территории, включая город и космодром Байконур"],
  ["38", "Иркутская область"],
  ["07", "Кабардино-Балкарская Республика"],
  ["39", "Калининградская область"],
  ["40", "Калужская область"],
  ["41", "Камчатский край"],
  ["09", "Карачаево-Черкесская Республика"],
  ["42", "Кемеровская область"],
  ["43", "Кировская область"],
  ["44", "Костромская область"],
  ["23", "Краснодарский край"],
  ["24", "Красноярский край"],
  ["45", "Курганская область"],
  ["46", "Курская область"],
  ["47", "Ленинградская область"],
  ["48", "Липецкая область"],
  ["49", "Магаданская область"],
  ["50", "Московская область"],
  ["51", "Мурманская область"],
  ["83", "Ненецкий автономный округ"],
  ["52", "Нижегородская область"],
  ["53", "Новгородская область"],
  ["54", "Новосибирская область"],
  ["55", "Омская область"],
  ["56", "Оренбургская область"],
  ["57", "Орловская область"],
  ["58", "Пензенская область"],
  ["59", "Пермский край"],
  ["25", "Приморский край"],
  ["60", "Псковская область"],
  ["01", "Республика Адыгея (Адыгея)"],
  ["04", "Республика Алтай"],
  ["02", "Республика Башкортостан"],
  ["03", "Республика Бурятия"],
  ["05", "Республика Дагестан"],
  ["06", "Республика Ингушетия"],
  ["08", "Республика Калмыкия"],
  ["10", "Республика Карелия"],
  ["11", "Республика Коми"],
  ["91", "Республика Крым"],
  ["12", "Республика Марий Эл"],
  ["13", "Республика Мордовия"],
  ["14", "Республика Саха (Якутия)"],
  ["15", "Республика Северная Осетия - Алания"],
  ["16", "Республика Татарстан (Татарстан)"],
  ["17", "Республика Тыва"],
  ["19", "Республика Хакасия"],
  ["61", "Ростовская область"],
  ["62", "Рязанская область"],
  ["63", "Самарская область"],
  ["78", "Санкт-Петербург"],
  ["64", "Саратовская область"],
  ["65", "Сахалинская область"],
  ["66", "Свердловская область"],
  ["92", "Севастополь"],
  ["67", "Смоленская область"],
  ["26", "Ставропольский край"],
  ["68", "Тамбовская область"],
  ["69", "Тверская область"],
  ["70", "Томская область"],
  ["71", "Тульская область"],
  ["72", "Тюменская область"],
  ["18", "Удмуртская Республика"],
  ["73", "Ульяновская область"],
  ["27", "Хабаровский край"],
  ["86", "Ханты-Мансийский автономный округ - Югра"],
  ["74", "Челябинская область"],
  ["20", "Чеченская Республика"],
  ["21", "Чувашская Республика - Чувашия"],
  ["87", "Чукотский автономный округ"],
  ["89", "Ямало-Ненецкий автономный округ"],
  ["76", "Ярославская область"]
];

/* TASK 1 */

router.get("/number/:value", function(request, response) {
  const value = request.params["value"];
  const number = Math.abs(+value);
  const valueLength = +value >= 0 ? value.length : value.length - 1;
  let answer = +value >= 0 ? "" : "минус ";

  switch (valueLength) {
    case 1:
    case 2: {
      if (number < 20) answer += NUMBERS_ARRAY[0][number];
      else {
        let firstDigit = Math.trunc(number / 10);
        let secondDigit = number % 10;
        answer = NUMBERS_ARRAY[1][firstDigit];
        if (secondDigit !== 0) answer += " " + NUMBERS_ARRAY[0][secondDigit];
      }
      break;
    }
    case 3: {
      let firstDigit = Math.trunc(number / 100);
      let secondDigit = number % 100;
      answer += NUMBERS_ARRAY[2][firstDigit];

      if (secondDigit !== 0) {
        if (secondDigit < 20) answer += " " + NUMBERS_ARRAY[0][secondDigit];
        else {
          let digit1 = Math.trunc(secondDigit / 10);
          let digit2 = secondDigit % 10;
          answer += " " + NUMBERS_ARRAY[1][digit1];
          if (digit2 !== 0) answer += " " + NUMBERS_ARRAY[0][digit2];
        }
      }
      break;
    }
    default: {
      answer = "такие числа писать не умею";
      break;
    }
  }

  response.send(answer);
});

/* TASK 2 */

router.get("/equation", function(request, response) {
  let a = +request.query.a;
  let b = +request.query.b;
  let c = +request.query.c;
  let answer = "";

  let discriminant = b ** 2 - 4 * a * c;
  if (discriminant >= 0) {
    if (discriminant === 0) {
      let x = -b / (2 * a);
      answer = `x = ${x}, (D = 0)`;
    } else {
      let x1 = (-b + discriminant ** (1 / 2)) / (2 * a);
      let x2 = (-b - discriminant ** (1 / 2)) / (2 * a);
      answer = `x1 = ${x1}, x2 = ${x2}, (D > 0)`;
    }
  } else answer = "уравнение не имеет корней (D < 0)";

  response.send(answer);
});

/* TASK 3 */

router.get("/day", function(request, response) {
  let query = request.query["date"];
  let date = new Date(query);
  let dayNumber = date.getDay();
  let days = [
    "воскресенье",
    "понедельник",
    "вторник",
    "среда",
    "четверг",
    "пятница",
    "суббота"
  ];
  response.send(days[dayNumber]);
});

/* TASK 4 */

router.get("/fib/:number", function(request, responce) {
  let n = request.params["number"];
  if (+n >= 0) {
    let a = 1;
    let b = 1;

    for (let i = 3; i <= n; i++) {
      let temp = a + b;
      a = b;
      b = temp;
    }

    responce.send(b.toString());
  } else responce.send("отрицательное число");
});

/* TASK 5 */

router.get("/regions/:region", function(request, responce) {
  let number = request.params["region"];

  for (let i = 0; i < REGIONS.length; i++) {
    if (REGIONS[i][0] === number) {
      responce.send(REGIONS[i][1]);
    }
  }
  responce.send("не могу найти");
});

module.exports = router;
